Revit 2024 API
WireSize.Diameter Property
 Get diameter of wire.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Diameter { get; }
Visual Basic
Public ReadOnly Property Diameter As Double
	Get
Visual C++
public:
property double Diameter {
	double get ();
}
See Also
WireSize Class
Autodesk.Revit.DB.Electrical Namespace